In [1]:
import pandas as pd

In [2]:
pd.__version__

'1.4.4'

In [3]:
list_s =[1,2,-3,6.2,'data values']
print(list_s)

[1, 2, -3, 6.2, 'data values']

In [4]:
series1 = pd.Series(list_s)
print(series1)

0              1
1              2
2             -3
3            6.2
4    data values
dtype: object

In [5]:
type(series1)

pandas.core.series.Series

In [6]:
series2 = pd.Series([4,5,6,7,3.4])
print(series2)

0    4.0
1    5.0
2    6.0
3    7.0
4    3.4
dtype: float64

In [7]:
type(series2)

pandas.core.series.Series

In [8]:
empty_s = pd.Series([])
print(empty_s)

Series([], dtype: float64)

C:\Users\HP\AppData\Local\Temp\ipykernel_6852\3878301290.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  empty_s = pd.Series([])

In [9]:
series3 = pd.Series([1,2,3,4], index = ['a','b','c','d'])
print(series3)

a    1
b    2
c    3
d    4
dtype: int64

In [10]:
series3 = pd.Series([1,2,3,4], index = ['a','b','c','d'],dtype = float)
print(series3)

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

In [11]:
series3 = pd.Series([1,2,3,4], index = ['a','b','c','d'],dtype = float, name = 'data values')
print(series3)

a    1.0
b    2.0
c    3.0
d    4.0
Name: data values, dtype: float64

# Scalar Values

In [12]:
scalar_s = pd.Series(0.5)
print(scalar_s)

0    0.5
dtype: float64

In [13]:
scalar_s = pd.Series(0.5,index = [1,2,3])
print(scalar_s)

1    0.5
2    0.5
3    0.5
dtype: float64

# dict Scalar Values

In [14]:
dict_s = pd.Series({'a':1,'b':2})
print(dict_s)

a    1
b    2
dtype: int64

In [15]:
s4 = pd.Series([1,2,3,4])
print(s4)

0    1
1    2
2    3
3    4
dtype: int64

In [16]:
s4[0]

1

In [17]:
s4[2]

3

In [18]:
s4[0:3]

0    1
1    2
2    3
dtype: int64

In [19]:
max(s4)

4

In [20]:
min(s4)

1

In [21]:
s4[s4>3]

3    4
dtype: int64

In [22]:
s4

0    1
1    2
2    3
3    4
dtype: int64

In [23]:
s5 = pd.Series([1,2,3,4,5])
print(s5)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [24]:
s4 + s5

0    2.0
1    4.0
2    6.0
3    8.0
4    NaN
dtype: float64

In [25]:
s6 = pd.Series([1,2])
print(s6)

0    1
1    2
dtype: int64

In [26]:
s5 + s6

0    2.0
1    4.0
2    NaN
3    NaN
4    NaN
dtype: float64

# head

In [27]:
import pandas as pd

In [28]:
df = pd.read_csv('E:\\MACHIN LEARING\\DataSets\\Fortune_10.csv')

In [29]:
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916,20%
2,3,Canecorporation,Health,2012,"$10,597,009","7,591,189 Dollars",3005820,7%
3,4,Mattouch,IT Services,2013,"$14,026,934","7,429,377 Dollars",6597557,26%
4,5,Techdrill,Health,2009,"$10,573,990","7,435,363 Dollars",3138627,8%
5,6,Techline,Health,2006,"$13,898,119","5,470,303 Dollars",8427816,23%
6,7,Cityace,Health,2010,"$9,254,614","6,249,498 Dollars",3005116,6%
7,8,Kayelectronics,Health,2009,"$9,451,943","3,878,113 Dollars",5573830,4%
8,9,Ganzlax,IT Services,2011,"$14,001,180",NaN,11901180,18%
9,10,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060,7%

In [30]:
df.head()#returns new df of last rows

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916,20%
2,3,Canecorporation,Health,2012,"$10,597,009","7,591,189 Dollars",3005820,7%
3,4,Mattouch,IT Services,2013,"$14,026,934","7,429,377 Dollars",6597557,26%
4,5,Techdrill,Health,2009,"$10,573,990","7,435,363 Dollars",3138627,8%

In [31]:
df.head(3)# returns new df of first 3 rows

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916,20%
2,3,Canecorporation,Health,2012,"$10,597,009","7,591,189 Dollars",3005820,7%

In [32]:
df.tail()# returns new df of last rows

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
5,6,Techline,Health,2006,"$13,898,119","5,470,303 Dollars",8427816,23%
6,7,Cityace,Health,2010,"$9,254,614","6,249,498 Dollars",3005116,6%
7,8,Kayelectronics,Health,2009,"$9,451,943","3,878,113 Dollars",5573830,4%
8,9,Ganzlax,IT Services,2011,"$14,001,180",NaN,11901180,18%
9,10,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060,7%

In [33]:
df.sample(n=5)# returns new df of randomly selceted 5 rows

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
7,8,Kayelectronics,Health,2009,"$9,451,943","3,878,113 Dollars",5573830,4%
5,6,Techline,Health,2006,"$13,898,119","5,470,303 Dollars",8427816,23%
3,4,Mattouch,IT Services,2013,"$14,026,934","7,429,377 Dollars",6597557,26%
6,7,Cityace,Health,2010,"$9,254,614","6,249,498 Dollars",3005116,6%
9,10,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060,7%

In [34]:
df.sample()# # default sample size is 1

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
4,5,Techdrill,Health,2009,"$10,573,990","7,435,363 Dollars",3138627,8%

In [35]:
# DataFrame Properties
print(df.shape) # returns a tuple of (r,c)
print(df.dtypes)# returns a series of datatypesnfor alll columns
print(df.size)# count of individual values
# loc
# iloc
# at
#ilt

(10, 8)
ID            int64
Name         object
Industry     object
Inception     int64
Revenue      object
Expenses     object
Profit        int64
Growth       object
dtype: object
80

In [36]:
df.sample(frac=.2).shape

(2, 8)

In [37]:
df.sample(frac=.2)

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
4,5,Techdrill,Health,2009,"$10,573,990","7,435,363 Dollars",3138627,8%
6,7,Cityace,Health,2010,"$9,254,614","6,249,498 Dollars",3005116,6%

In [38]:
df.sample(n=250)

ValueError: Cannot take a larger sample than population when 'replace=False'

In [39]:
df.sample(n=10,replace=True)# random sampling with replacement,i.e same sample can be selected more than once

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
9,10,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060,7%
5,6,Techline,Health,2006,"$13,898,119","5,470,303 Dollars",8427816,23%
4,5,Techdrill,Health,2009,"$10,573,990","7,435,363 Dollars",3138627,8%
9,10,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060,7%
7,8,Kayelectronics,Health,2009,"$9,451,943","3,878,113 Dollars",5573830,4%
7,8,Kayelectronics,Health,2009,"$9,451,943","3,878,113 Dollars",5573830,4%
5,6,Techline,Health,2006,"$13,898,119","5,470,303 Dollars",8427816,23%
9,10,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060,7%
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
9,10,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060,7%

In [40]:
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916,20%
2,3,Canecorporation,Health,2012,"$10,597,009","7,591,189 Dollars",3005820,7%
3,4,Mattouch,IT Services,2013,"$14,026,934","7,429,377 Dollars",6597557,26%
4,5,Techdrill,Health,2009,"$10,573,990","7,435,363 Dollars",3138627,8%
5,6,Techline,Health,2006,"$13,898,119","5,470,303 Dollars",8427816,23%
6,7,Cityace,Health,2010,"$9,254,614","6,249,498 Dollars",3005116,6%
7,8,Kayelectronics,Health,2009,"$9,451,943","3,878,113 Dollars",5573830,4%
8,9,Ganzlax,IT Services,2011,"$14,001,180",NaN,11901180,18%
9,10,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060,7%

In [41]:
df.select_dtypes(include='float') # returns a new dataframe having only float values

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [42]:
df.select_dtypes(exclude='float') # returns a new dataframe having any types values except values

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916,20%
2,3,Canecorporation,Health,2012,"$10,597,009","7,591,189 Dollars",3005820,7%
3,4,Mattouch,IT Services,2013,"$14,026,934","7,429,377 Dollars",6597557,26%
4,5,Techdrill,Health,2009,"$10,573,990","7,435,363 Dollars",3138627,8%
5,6,Techline,Health,2006,"$13,898,119","5,470,303 Dollars",8427816,23%
6,7,Cityace,Health,2010,"$9,254,614","6,249,498 Dollars",3005116,6%
7,8,Kayelectronics,Health,2009,"$9,451,943","3,878,113 Dollars",5573830,4%
8,9,Ganzlax,IT Services,2011,"$14,001,180",NaN,11901180,18%
9,10,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060,7%

In [43]:
df.select_dtypes(include=['float','int']) # returns a new dataframe having any types values except values

   ID  Inception    Profit
0   1       2009   5274553
1   2       2010  11412916
2   3       2012   3005820
3   4       2013   6597557
4   5       2009   3138627
5   6       2006   8427816
6   7       2010   3005116
7   8       2009   5573830
8   9       2011  11901180
9  10       2011   5453060

In [44]:
df.select_dtypes(include='object') # returns a new dataframe having any object(str) values except values

,Name,Industry,Revenue,Expenses,Growth
0,Lamtone,IT Services,"$11,757,018","6,482,465 Dollars",30%
1,Stripfind,Financial Services,"$12,329,371","916,455 Dollars",20%
2,Canecorporation,Health,"$10,597,009","7,591,189 Dollars",7%
3,Mattouch,IT Services,"$14,026,934","7,429,377 Dollars",26%
4,Techdrill,Health,"$10,573,990","7,435,363 Dollars",8%
5,Techline,Health,"$13,898,119","5,470,303 Dollars",23%
6,Cityace,Health,"$9,254,614","6,249,498 Dollars",6%
7,Kayelectronics,Health,"$9,451,943","3,878,113 Dollars",4%
8,Ganzlax,IT Services,"$14,001,180",NaN,18%
9,Trantraxlax,Government Services,"$11,088,336","5,635,276 Dollars",7%

In [ ]:
#df.select_dtypes(include=['float','int']) # returns a new dataframe having any types values except values

# rows filter

In [ ]:
#df['col_label']
#df[['col_label1','col_label2','col_label3',.....]]
#df[(condition)& (condition2) | ......()]

In [45]:
df[(df['Growth']=='7%') & (df['Expenses']=='Dollars')]

Empty DataFrame
Columns: [ID, Name, Industry, Inception, Revenue, Expenses, Profit, Growth]
Index: []

In [46]:
df[(df['Expenses']=='Dollars') & (df['Expenses']=='Dollars')].shape

(0, 8)

In [47]:
# df['Growth']
df.Growth

0    30%
1    20%
2     7%
3    26%
4     8%
5    23%
6     6%
7     4%
8    18%
9     7%
Name: Growth, dtype: object

In [48]:
df.Revenue

0    $11,757,018
1    $12,329,371
2    $10,597,009
3    $14,026,934
4    $10,573,990
5    $13,898,119
6     $9,254,614
7     $9,451,943
8    $14,001,180
9    $11,088,336
Name: Revenue, dtype: object

In [49]:
df.size

80

In [ ]:
df['Name']

In [50]:
df[(df.Growth=='7%') & (df.Expenses=='Dollars')].shape

(0, 8)

In [52]:
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916,20%
2,3,Canecorporation,Health,2012,"$10,597,009","7,591,189 Dollars",3005820,7%
3,4,Mattouch,IT Services,2013,"$14,026,934","7,429,377 Dollars",6597557,26%
4,5,Techdrill,Health,2009,"$10,573,990","7,435,363 Dollars",3138627,8%
5,6,Techline,Health,2006,"$13,898,119","5,470,303 Dollars",8427816,23%
6,7,Cityace,Health,2010,"$9,254,614","6,249,498 Dollars",3005116,6%
7,8,Kayelectronics,Health,2009,"$9,451,943","3,878,113 Dollars",5573830,4%
8,9,Ganzlax,IT Services,2011,"$14,001,180",NaN,11901180,18%
9,10,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060,7%

In [51]:
df2=df.sort_values(by="Revenue")
df2

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
4,5,Techdrill,Health,2009,"$10,573,990","7,435,363 Dollars",3138627,8%
2,3,Canecorporation,Health,2012,"$10,597,009","7,591,189 Dollars",3005820,7%
9,10,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060,7%
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916,20%
5,6,Techline,Health,2006,"$13,898,119","5,470,303 Dollars",8427816,23%
8,9,Ganzlax,IT Services,2011,"$14,001,180",NaN,11901180,18%
3,4,Mattouch,IT Services,2013,"$14,026,934","7,429,377 Dollars",6597557,26%
6,7,Cityace,Health,2010,"$9,254,614","6,249,498 Dollars",3005116,6%
7,8,Kayelectronics,Health,2009,"$9,451,943","3,878,113 Dollars",5573830,4%

In [ ]:
df2["Revenue"]

In [ ]:
df2=df.sort_values(by="Revenue")[["Revenue"]]
df2

In [ ]:
df2=df.sort_values(by="Revenue",ascending=False)

In [ ]:
df2

In [ ]:
df2=df.sort_values(by=["Growth","Name"],ascending=False)

In [ ]:
df2

In [ ]:
df

In [ ]:
# single values show

In [ ]:
# 
df.rename({'Name':'rka'},axis=1) #

In [ ]:
df.rename({1:500},axis=0)

In [ ]:
df.rename({1:'india'},axis=0)

In [ ]:
#df.at[index,cil_lable]
#df.at["india",'Name']

In [ ]:
df.rename({1:'india'},axis=0,inplace=True) # change to existing value

In [ ]:
df.at["india",'Name']

In [ ]:
df

In [ ]:
df.iat[1,0]

In [ ]:
df.iat[1,-8]

In [ ]:
df.iat[1,-8]=222

In [ ]:
df

In [ ]:
df.at["india",'Name']=14

In [ ]:
df

In [ ]:
df

In [ ]:
df.index

In [ ]:
df.columns

# loc & iloc

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("E:\\DUCAT_PYTHON COURSE\\dataset\\analysis\\restaurant.csv")

In [3]:
df

     total_bill   tip  gender smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [ ]:
df.loc[0]

In [ ]:
df.loc[[0,2]]

In [ ]:
# axis =0 rows
#axis = 1 col
df.rename({0:'rahul',1:'rka'},axis=0)

In [ ]:
df.loc[[0]]

In [ ]:
df[['total_bill','tip','day']]

In [ ]:
df.loc[[0]]['gender']

In [ ]:
df.iloc[[0]]

In [ ]:
# df.loc[2]
df.iloc[0]

In [ ]:
df

In [ ]:
#df.loc[stratIndex:stopIndex:setp,stratLable:stopLable:step]

In [ ]:
df.loc[0:1:1,'total_bill':'day':1]

In [ ]:
df.loc[5:50:5,'total_bill':'size':2] # inclusive

In [ ]:
df.iloc[5:50:5,0:6:2] # exclusive

In [ ]:
#loc & iloc defalut value

In [ ]:
df.loc[5:50,'total_bill':'size']

In [ ]:
df.iloc[5:50,0:6]

In [ ]:
df.iloc[5:,:2]

In [ ]:
df.iloc[5:,::-1]

In [ ]:
df.iloc[::-1,::-1]

In [ ]:
df

In [ ]:
df.rename({0:'rahul',1:'rka'},inplace=True)
df

In [ ]:
df

In [ ]:
df.iloc[5:51,[4,2,1]]

In [ ]:
#df.iloc[5:51,[4,3,2,1]]
df.iloc[5:51,-3:-7:-1]

In [ ]:
df.rename({'rahul':0,'rka':1},inplace=True)

In [ ]:
df

# statatics series

In [ ]:
s=df.total_bill
type(s)

In [ ]:
s.sum()

In [ ]:
# single stmts

In [ ]:
df.total_bill.sum()

In [ ]:
df.total_bill.mean()

In [ ]:
df.total_bill.count()

In [ ]:
df.total_bill.max()

In [ ]:
df.total_bill.min()

In [ ]:
df.total_bill.std()

In [ ]:
df.total_bill.median()

In [ ]:
df.gender.sum()

In [ ]:
df.gender.min()

In [ ]:
df.gender.max()

In [ ]:
df.gender.unique() # string column see

In [ ]:
df.day.unique()

string
>categorical
>text

In [ ]:
df.time.unique()

In [ ]:
df

In [ ]:
df.time.value_counts()

In [4]:
df.day.value_counts()

Sat     87
Sun     76
Thur    62
Fri     19
Name: day, dtype: int64

In [ ]:
# dataframe summary(statatics)

In [ ]:
df.describe() # returns dataframe new df containing summary of existing df

In [ ]:
df.describe(include='all')

In [53]:
df.describe(include='object')

           Name Industry       Revenue           Expenses Growth
count        10       10            10                  9     10
unique       10        4            10                  9      9
top     Lamtone   Health  $11,757,018   6,482,465 Dollars     7%
freq          1        5             1                  1      2

In [55]:
df.describe(include='number')

             ID    Inception        Profit
count  10.00000    10.000000  1.000000e+01
mean    5.50000  2010.000000  6.379048e+06
std     3.02765     1.943651  3.267128e+06
min     1.00000  2006.000000  3.005116e+06
25%     3.25000  2009.000000  3.672608e+06
50%     5.50000  2010.000000  5.513445e+06
75%     7.75000  2011.000000  7.970251e+06
max    10.00000  2013.000000  1.190118e+07

# data Summary
 > df.describe()
 > df.pivot_table()
 > df.groupby()

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("E:\\DUCAT_PYTHON COURSE\\dataset\\analysis\\restaurant.csv")

In [3]:
df

     total_bill   tip  gender smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [4]:
# groupby()
df.groupby(by="day")[["total_bill"]].sum() # returns a Dataframe

      total_bill
day
Fri       325.88
Sat      1778.40
Sun      1627.16
Thur     1096.33

In [5]:
# pivot_table()
df.pivot_table(index="day",values="total_bill",aggfunc="sum")

      total_bill
day
Fri       325.88
Sat      1778.40
Sun      1627.16
Thur     1096.33

In [6]:
df.groupby(by=["day","time"])[["total_bill"]].sum() # returns a Dataframe

             total_bill
day  time
Fri  Dinner      235.96
     Lunch        89.92
Sat  Dinner     1778.40
Sun  Dinner     1627.16
Thur Dinner       18.78
     Lunch      1077.55

In [7]:
df.pivot_table(index=["day","time"],values="total_bill",aggfunc="sum")

             total_bill
day  time
Fri  Dinner      235.96
     Lunch        89.92
Sat  Dinner     1778.40
Sun  Dinner     1627.16
Thur Dinner       18.78
     Lunch      1077.55

In [10]:
df.pivot_table(index=["day"],columns="time",values="total_bill",aggfunc="sum")

time   Dinner    Lunch
day
Fri    235.96    89.92
Sat   1778.40      NaN
Sun   1627.16      NaN
Thur    18.78  1077.55

In [11]:
df.pivot_table(index=["day"],columns="time",values="total_bill",aggfunc=["sum","mean","count"])

          sum                mean             count
time   Dinner    Lunch     Dinner      Lunch Dinner Lunch
day
Fri    235.96    89.92  19.663333  12.845714   12.0   7.0
Sat   1778.40      NaN  20.441379        NaN   87.0   NaN
Sun   1627.16      NaN  21.410000        NaN   76.0   NaN
Thur    18.78  1077.55  18.780000  17.664754    1.0  61.0

In [12]:
resdf=df.pivot_table(index=["day"],columns="time",values="total_bill",aggfunc=["sum","mean","count"])

In [25]:
resdf.to_excel("report.xlsx")

In [26]:
df.info() # returns meta information

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   gender       891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [27]:
df[(df.time=="Lunch") & (df.day=="sun")]

AttributeError: 'DataFrame' object has no attribute 'time'

In [18]:
df[(df.time=="Dinner") & (df.gender=="Female")].shape

(52, 7)

In [19]:
df[(df.time=="Dinner") & (df.gender=="Male")].shape

(124, 7)

In [20]:
df[(df.time=="Dinner")].shape

(176, 7)

In [22]:
52/176 # 29% female and 71% male

0.29545454545454547

In [23]:
df=pd.read_csv("E:\\DUCAT_PYTHON COURSE\\dataset\\analysis\\titanic.csv")

In [28]:
df

,PassengerId,Survived,Pclass,Name,gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q